#include <stdio.h>

int main()
{
	int chk[10000]={0};//1~10000까지 셀프수라 생각하고 0으로 설정. 
	int i;//반복변수 
	int sum; //1~10000까지 숫자를 대입하여 셀프넘버 구하기.
	
	for(i=1;i<=10000;i++)
	{
		sum=0;//sum의 초기값 설정.
		if(i>=10000)//ex)12345=12345+5+4+3+2+1
			sum=i+i%10+(((i%10000)%1000)%100)/10+((i%10000)%1000)/100+(i%10000)/1000+i/10000;
		     //12345+5+     4                   +         3          +      2       +   1
		else if(i>=1000)//ex)1234=1234+4+3+2+1
			sum=i+i%10+((i%1000)%100)/10+(i%1000)/100+i/1000;
			 //1234+ 4 + 3              +   2        +   1			 
		else if(i>=100)//ex)123+3+2+1
			sum=i+i%10+(i%100)/10+i/100;
		else if(i>=10)//ex)12=2+1
			sum=i+i%10+i/10;
		else 
			sum=i+i%10;
		if(sum<=10000) chk[sum]++;
	} 
	
	for(i=1;i<=10000;i++)
		if(!chk[i]) printf("%d\n",i);
	
	return 0;
}